#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>
```


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-east-2"
      + tags_all = (known after apply)
      + vpc_id   = (known after apply)
    }

  # aws_route_table.rt_public will be created
  + resource "aws_route_table" "rt_public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-east-2"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.rt_association_0 will be created
  + resource "aws_route_table_association" "rt_association_0" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rt_association_1 will be created
  + resource "aws_route_table_association" "rt_association_1" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.rt_association_2 will be created
  + resource "aws_route_table_association" "rt_association_2" {
      + id             = (known after apply)
      + region         = "us-east-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.spoobucket-aula will be created
  + resource "aws_s3_bucket" "spoobucket-aula" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "spoo-ent3-backend"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + tags_all                    = {
          + "Environment" = "Production"
          + "Name"        = "tfstate"
          + "School"      = "FIAP"
          + "Year"        = "2025"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_subnet.subnet_public[0] will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "fiap-terraform-aula"
        }
      + tags_all                                       = {
          + "Name" = "fiap-terraform-aula"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_public[1] will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "fiap-terraform-aula"
        }
      + tags_all                                       = {
          + "Name" = "fiap-terraform-aula"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.subnet_public[2] will be created
  + resource "aws_subnet" "subnet_public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-east-2"
      + tags                                           = {
          + "Name" = "fiap-terraform-aula"
        }
      + tags_all                                       = {
          + "Name" = "fiap-terraform-aula"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc_fiap will be created
  + resource "aws_vpc" "vpc_fiap" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-east-2"
      + tags                                 = {
          + "Name" = "fiap-terraform-aula"
        }
      + tags_all                             = {
          + "Name" = "fiap-terraform-aula"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_cidr = [
      + "10.0.0.0/20",
      + "10.0.16.0/20",
      + "10.0.32.0/20",
    ]
  + subnet_id   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr    = "10.0.0.0/16"
  + vpc_id      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @CRASPOO, Action: `pull_request`*